app/Http/Controllers/Admin/Services/serviceController.php

    public function index()
    {
        $page_title = __("Services");

        $servicesWithBookingStatus = Service::join('service_bookings', 'services.id', '=', 'service_bookings.service_id')
            ->select('services.id', 'services.service_area_id', 'services.service_type_id', 'services.slug', 'services.name','services.size', 'services.number_bottles', 'services.price','services.image', 'services.status', DB::raw('MAX(service_bookings.status) as booking_status'))
            ->groupBy('services.id', 'services.service_area_id', 'services.service_type_id', 'services.slug', 'services.number_bottles', 'services.price','services.image', 'services.status')
            ->get();

        $servicesWithoutBookings = Service::query()->whereDoesntHave('bookings')->get();
---
select `services`.`id`, `services`.`service_area_id`, `services`.`service_type_id`, `services`.`slug`, `services`.`name`, `services`.`size`, `services`.`number_bottles`, `services`.`price`, `services`.`image`, `services`.`status`, MAX(service_bookings.status) as booking_status from `services` inner join `service_bookings` on `services`.`id` = `service_bookings`.`service_id` group by `services`.`id`, `services`.`service_area_id`, `services`.`service_type_id`, `services`.`slug`, `services`.`number_bottles`, `services`.`price`, `services`.`image`, `services`.`status`
select * from `services` where not exists (select * from `service_bookings` where `services`.`id` = `service_bookings`.`service_id`)