app/Http/Controllers/Admin/Services/serviceAreaController.php

    public function index(){
        $page_title = __("Service Area");
        $service_area = ServiceArea::query()->orderByDesc("id")->get();
---
select * from `service_areas` order by `id` desc