app/Http/Controllers/Admin/Services/serviceTypeController.php

    public function index()
    {
        $page_title = __("Service Types");
        $service_types = ServiceType::query()->orderByDesc("id")->paginate(11);
---
select * from `service_types` order by `id` desc limit 11 offset 0
select count(*) as aggregate from `service_types`