app/Http/Controllers/Admin/Coupon/CouponController.php

    public function index()
    {
        $page_title = __("Coupon List");
        $coupons = Coupon::query()->latest()->get();
---
select * from `coupons` order by `created_at` desc

    public function store(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'name' => 'required|string',
            'discount' => 'required|numeric',
            'code'=>  'required|string|unique:coupons,code',
            'expiry_date' => 'required',
        ]);
        if ($validator->fails()) {
            return back()->withErrors($validator);
        }

        $data = $request->only(['name','discount','code','expiry_date']);
        try {
            Coupon::query()->create($data);
---
insert into `coupons` (`name`, `discount`, `code`, `expiry_date`, `updated_at`, `created_at`) values ('كود خصم نهاية العام', '15', 'FDFFfdff2665f', '2025-03-23', '2025-03-23 17:58:47', '2025-03-23 17:58:47')

    public function edit($id)
    {
        $coupon = Coupon::query()->find($id);
---
select * from `coupons` where `coupons`.`id` = '2' limit 1

    public function update(Request $request, $id)
    {
        $request->request->add(['id' => $id]);
        $coupon = Coupon::query()->find($id);
---
select * from `coupons` where `coupons`.`id` = '2' limit 1

    public function delete(Request $request)
    {
        $request->validate([
            'target'    => 'required|numeric|',
        ]);
        $coupon = Coupon::query()->find($request->target);

        try {
            $coupon->delete();
---
select * from `coupons` where `coupons`.`id` = '1' limit 1
delete from `coupons` where `id` = 1

    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:coupons,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }
        $validated = $validator->validate();

        $coupon = Coupon::find($validated['data_target']);

        try{
            $coupon->update([
                'status'        => ($validated['status']) ? false : true,
            ]);
---
select * from `coupons` where `coupons`.`id` = '2' limit 1
update `coupons` set `status` = 0, `coupons`.`updated_at` = '2025-03-23 18:10:06' where `id` = 2