app/Http/Controllers/SubscriberController.php

select count(*) as aggregate from `subscribers`
---
    public function index()
    {
        $page_title = __("Subscribers");
        $subscribers = Subscriber::orderBy('id', 'desc')->paginate(10);