app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {

        $page_title = __("Dashboard");
        $users = User::count();
        $activeUsers = User::where('status', 1)->count();
        $bannedUsers = User::where('status', 0)->count();
        $verifiedUsers = User::where('email_verified', 1)->count();

        $announcements = Announcement::count();
        $activeAnnouncements = Announcement::where('status', 1)->count();
        $bannedAnnouncements = Announcement::where('status', 0)->count();

        $subscribers = Subscriber::count();
        $currentMonthSubscribers = Subscriber::whereMonth('created_at', Carbon::now()->month)->count();
        $currentYearSubscribers = Subscriber::whereYear('created_at', Carbon::now()->year)->count();

        $messages = ContactMessage::count();
        $repliedMessages = ContactMessage::where('reply', 1)->count();
        $unansweredMessages = ContactMessage::where('reply', 0)->count();

        $areas = ServiceArea::query()->count();
        $activeAreas = ServiceArea::query()->where('status', 1)->count();
        $bannedAreas = ServiceArea::query()->where('status', 0)->count();

//        $areas = CarArea::count();
//        $activeAreas = CarArea::where('status', 1)->count();
//        $bannedAreas = CarArea::where('status', 0)->count();

        $types = ServiceType::query()->count();
        $activeTypes = ServiceType::query()->where('status', 1)->count();
        $bannedTypes = ServiceType::query()->where('status', 0)->count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `users` where `email_verified` = 1
select count(*) as aggregate from `announcement`
select count(*) as aggregate from `announcement` where `status` = 1
select count(*) as aggregate from `announcement` where `status` = 0
select count(*) as aggregate from `subscribers`
select count(*) as aggregate from `subscribers` where month(`created_at`) = '03'
select count(*) as aggregate from `subscribers` where year(`created_at`) = 2025
select count(*) as aggregate from `contact_messages`
select count(*) as aggregate from `contact_messages` where `reply` = 1
select count(*) as aggregate from `contact_messages` where `reply` = 0
select count(*) as aggregate from `service_areas`
select count(*) as aggregate from `service_areas` where `status` = 1
select count(*) as aggregate from `service_areas` where `status` = 0
select count(*) as aggregate from `service_types`
select count(*) as aggregate from `service_types` where `status` = 1
select count(*) as aggregate from `service_types` where `status` = 0

//        $activeTypes = CarType::where('status', 1)->count();
//        $bannedTypes = CarType::where('status', 0)->count();

        $services = Service::query()->count();
        $activeServices = Service::query()->where('status', 1)->count();
        $bannedServices = Service::query()->where('status', 0)->count();
---
select count(*) as aggregate from `services`
select count(*) as aggregate from `services` where `status` = 1
select count(*) as aggregate from `services` where `status` = 0

//        $activeCars = Car::where('status', 1)->count();
//        $bannedCars = Car::where('status', 0)->count();

        $tickets = UserSupportTicket::count();
        $activeTickets = UserSupportTicket::where('status', 2)->count();
        $solvedTickets = UserSupportTicket::where('status', 1)->count();
        $pendingTickets = UserSupportTicket::where('status', 3)->count();
---
select count(*) as aggregate from `user_support_tickets`
select count(*) as aggregate from `user_support_tickets` where `status` = 2
select count(*) as aggregate from `user_support_tickets` where `status` = 1
select count(*) as aggregate from `user_support_tickets` where `status` = 3