app/Http/Controllers/Admin/PushNotificationController.php

select count(*) as aggregate from `push_notification_records`
---
    public function index()
    {
        $page_title = __("Send Notification");
        $notifications = PushNotificationRecord::orderByDesc("id")->paginate(10);