app/Http/Controllers/Admin/ServiceBookingController.php

select count(*) as aggregate from `service_bookings`
---
    public function index(){

        $page_title = __("Bookings");
        $service_bookings = ServiceBooking::with(['service'])->orderByDesc("id")->paginate(10);