app/Http/Controllers/Admin/SetupSectionsController.php

    public function __construct()
    {
        $this->languages = Language::get();
---
select * from `languages`

    public function categoryView()
    {
        $page_title = __("Announcement Category");
        $allCategory = AnnouncementCategory::orderByDesc('id')->paginate(10);
---
select * from `announcement_categories` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `announcement_categories`