app/Http/Controllers/Admin/SystemMaintenanceController.php

    public function index()
    {
        $page_title = __("System Maintenance");
        $data = SystemMaintenance::first();
---
select * from `system_maintenances` limit 1